Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier.RebarHook Property
 Gets or sets the reinforcing bar hook data.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarHookDataNullable RebarHook { get; set; }
Public Property RebarHook As RebarHookDataNullable
	Get
	Set
Property Value
Type: RebarHookDataNullable
See Also
Reference
RebarEndDetailModifier Class
Tekla.Structures.Model Namespace